Repository: zipf/perldoc-es
Catalog: memory/clean/omegat_clean_prj-level2.tmx
Source language: en_us
Languages: es

source: Individual committers should create topic branches under B<yourname>/B<some_descriptive_name>.
es: Los usuarios individuales que deseen aplicar cambios deben crear ramas puntuales en B<nombre>/B<nombre_descriptivo>.

source: Individual modules in F<lib/>, F<ext/>, F<dist/>, and F<cpan/> usually have their own documentation, either in the F<Module.pm> file or an accompanying F<Module.pod> file.
es: En general, los módulos individuales de F<lib/>, F<ext/>, F<dist/> y F<cpan/> tienen su propia documentación, ya sea en el archivo F<Módulo.pm> o en un archivo F<Módulo.pod> adjunto.

source: Information about hackathons can be located in the same place as information about L<workshops|"Workshops"> as well as in L<irc://irc.perl.org/#perl>.
es: Encontrará información sobre los I<hackathons> en el mismo lugar en el que se ofrece información sobre los L<talleres|"Talleres">, así como en L<irc://irc.perl.org/#perl>.

source: Information about irc.perl.org is located on the network's website: L<http://www.irc.perl.org>.
es: Encontrará información sobre irc.perl.org en el sitio web de la red: L<http://www.irc.perl.org>.

source: Inheritance allows two classes to share code.
es: La herencia permite que dos clases compartan código.

source: Inheritance lets the new class to reuse the methods and attributes of another class.
es: Mediante herencia, las nuevas clases pueden reutilizar los métodos y atributos de otra clase.

source: Initially, you write something like this:
es: Para empezar, lo intenta con:

source: Input from, or output to, a L</file> or L</device>.
es: Entrada desde (o salida a) un L</archivo> o L</dispositivo>.

source: Inside an C<END> code block, C<$?> contains the value that the program is going to pass to C<exit()>.
es: Dentro de un bloque de código C<END>, C<$?> contiene el valor que el programa va a pasar a C<exit()>.

source: Inside of a C<CHECK> block, the value of C<${^GLOBAL_PHASE}> will be C<"CHECK">.
es: Dentro de un bloque C<CHECK>, el valor de C<${^GLOBAL_PHASE}> es C<"CHECK">.

source: Inside of a C<END> block, the value of C<${^GLOBAL_PHASE}> will be C<"END">.
es: Dentro de un bloque C<END>, el valor de C<${^GLOBAL_PHASE}> es C<"END">.

source: Inside of an C<INIT> block, the value of C<${^GLOBAL_PHASE}> will be C<"INIT">.
es: Dentro de un bloque C<INIT> el valor de C<${^GLOBAL_PHASE}> será C<"INIT">.

source: Inside the C<(?{...})> block, C<$_> refers to the string the regular expression is matching against.
es: Dentro del bloque C<(?{...})>, C<$_> hace referencia a la cadena con la que se compara la expresión regular.

source: Instead Of: Use:
es: En lugar de: Use:

source: Instead Of: Use: But better use:
es: En lugar de: Use: O mejor:

source: Instead a compact form is used, which can only store values that are integers (signed and unsigned), strings or C<undef> - references and floating point values are stringified.
es: En su lugar se usa una forma compacta que solo puede almacenar valores enteros (con signo o sin signo), cadenas o C<undef>; las referencias y los valores de punto flotante se convierten en cadenas.

source: Instead of C<:encoding(UTF-8)>, you can simply use C, which skips the encoding step if the data was already represented as UTF8 internally.
es: En lugar de utilizar C<:encoding(UTF-8)>, puede usar simplemente C, omitiendo así el paso de codificación cuando los datos ya están representados internamente como UTF8.

source: Instead of C<FILE*> types, you need to be handling C<PerlIO*> types.
es: En lugar de tipos C<FILE*> debe manipular tipos C<PerlIO*>.

source: Instead of C<decode> and C<encode>, you could use C<_utf8_on> and C<_utf8_off>, but this is considered bad style.
es: En lugar de C<decode> y C<encode>, puede usar C<_utf8_on> y C<_utf8_off>, pero esto se considera poco elegante.

source: Instead of the F<stdio.h> functions, you should use the Perl abstraction layer.
es: En lugar de las funciones de F<stdio.h> debe usar la abstracción de capas de Perl.

source: Instead of using the current Perl internals, Ponie aimed to create a new one that would provide a translation path from Perl 5 to Perl 6 (or anything else that targets Parrot, actually).
es: La idea de Ponie era renovar los componentes internos de Perl para traducir código Perl 5 a Perl 6 (o a cualquier otro lenguaje compatible con Parrot).

source: Instead, the L<eval|perlfunc/eval> terminates after placing the exception message in the C<$@> (C<$EVAL_ERROR>) variable.
es: La función L<eval|perlfunc/eval> termina después de colocar el mensaje de excepción en la variable C<$@> (C<$EVAL_ERROR>).

source: Instead, we should use accessor methods to access the data in that hash.
es: En lugar de esto, deberíamos usar métodos de acceso para acceder a los datos del hash.

source: Instead, you just use symbolic pointers in the form of L<keys|/key> and L</variable> names, or L<hard references|/hard reference>, which aren't pointers (but act like pointers and do in fact contain pointers).
es: Solo tenemos que usar punteros simbólicos en forma de L<claves|/clave> y nombres de L</variable>, o L<referencias estrictas|/referencia estricta>, que no son punteros (pero actúan como si lo fueran; de hecho, contienen punteros).

source: Instead, you want to put the blame on the user, and say this:
es: En lugar de ello, tiene que atribuir la culpa al usuario y decir esto:

source: Internet Protocol, or Intellectual Property.
es: Protocolo de Internet (o Propiedad intelectual).

source: Interpolating it in a list has no effect.
es: Interpolarla en una lista no surte ningún efecto.

source: Interprocess Communication.
es: Comunicación entre procesos.

source: Introduce the F<.tar.gz> file into an HFS as binary; don't translate from ASCII to EBCDIC.
es: Introduzca el archivo F<.tar.gz> en un HFS como binario; no lo traduzca de ASCII a EBCDIC.

source: Introduced in Perl 5.005
es: Se incluyó en Perl 5.005

source: Introduced in Perl 5.13.7
es: Se incluyó en Perl 5.13.7

source: Introduced in Perl 5.6.0
es: Se incluyó en Perl 5.6.0

source: Introduced in Perl 5.6.1
es: Se incluyó en Perl 5.6.1

source: Introduced in Perl 5.7.0
es: Se incluyó en Perl 5.7.0

source: Introduced in Perl 5.8.0
es: Se incluyó en Perl 5.8.0

source: Introduced in Perl 5.9.0
es: Se incluyó en Perl 5.9.0

source: Introduced in Perl 5.9.2
es: Se incluyó en Perl 5.9.2

source: Introduced in: 5.11.2
es: Se incluyó en 5.11.2

source: Introduced in: Perl 5.10
es: Se incluyó en Perl 5.10

source: Introduced in: Perl 5.11.2
es: Se incluyó en Perl 5.11.2

source: Introduced in: Perl 5.12
es: Se incluyó en Perl 5.12

source: Invoking the regex engine in these blocks would make perl unstable.
es: Invocar el motor de expresiones regulares en estos bloques provocaría inestabilidad en perl.

source: Irish for the whole McGillicuddy.
es: Versión irlandesa de los McGillicuddy.

source: Irrespective of its distribution, all code examples here are in the public domain.
es: Independientemente de su distribución, todos los ejemplos de código incluidos son de dominio público.

source: It always succeeds, and its C<code> is not interpolated.
es: Siempre finaliza correctamente y su C<código> no se interpola.

source: It claims that there is no 123 in the string.
es: Afirma que la cadena no contiene 123.

source: It is intended as a "bootstrap" guide for those who are new to the language, and provides just enough information for you to be able to read other peoples' Perl and understand roughly what it's doing, or write your own simple scripts.
es: Es una guía de iniciación para los nuevos usuarios del lenguaje que proporciona la información necesaria para poder leer el código Perl de otras personas y comprender a grandes rasgos su funcionamiento, o para escribir scripts sencillos.

source: It looks like the same operator, but these are two different operations.
es: Parece el mismo operador, pero en realidad estas dos operaciones son diferentes.

source: It allows you to install modules or distributions from CPAN, or just get information about them, and a lot more.
es: Permite hacer muchas cosas, como instalar módulos o distribuciones de CPAN, o simplemente obtener información sobre ellas.

source: It also shows that there is one commit on the working branch C<blead> which has not been pushed to the C<origin> remote yet.
es: Además, indica que hay una confirmación en la rama de trabajo C<blead> que aún no se ha enviado al repositorio remoto C<origin>.

source: It also has a minimal C<Moose> compatibility mode which makes moving from C<Class::Accessor> to C<Moose> easy.
es: También ofrece un modo de compatibilidad mínima con C<Moose> que facilita la migración desde C<Class::Accessor> a C<Moose>.

source: It also is automatically enabled under C<use feature ':5.12'> or using C<-E> on the command line for Perl 5.12 or higher.
es: También se habilita automáticamente con C<use feature ':5.12'> o mediante el modificador C<-E> en la línea de comandos para Perl 5.12 o superior.

source: It also makes C++ programmers feel like they know what's going on--as opposed to using the single quote as separator, which was there to make Ada programmers feel like they knew what was going on.
es: Además, hace que los programadores de C++ se sientan más cómodos (más que si se usara la comilla, que se parece más al estilo seguido por los programadores de Ada).

source: It also means that C<$foo[1]> is a part of @foo, not a part of $foo.
es: También significa que C<$foo[1]> forma parte de @foo, no de $foo.

source: It also provides a "Moose-like" API on demand for the features it supports.
es: También proporciona una API "de tipo Moose" para las características que ofrece.

source: It also shows that there was an untracked file in the working directory, and as you can see shows how to change all of this.
es: También muestra que en el directorio de trabajo hay un archivo sin seguimiento y, como se puede ver, explica qué tiene que hacer para cambiar esto.

source: It also takes care of creating a C<new()> method for you.
es: También se ocupa de crear automáticamente un método C<new()>.

source: It begins with a brief overview of the concepts behind object oriented design.
es: Comienza con una breve descripción de los conceptos relacionados con el diseño orientado a objetos.

source: It can be useful but it may be a memory hog.
es: Puede resultar útil, pero esta operación consume mucha memoria.

source: It can be used after running C<make install> (or your platform's equivalent procedure) to verify that perl and its libraries have been installed correctly.
es: Se puede usar después de ejecutar C<make install> (o el procedimiento equivalente para su plataforma) para comprobar que perl y sus bibliotecas se han instalado correctamente.

source: It can be used interactively or imperatively.
es: Se puede usar de manera interactiva o imperativa.

source: It can be used to force the engine to backtrack.
es: Se puede utilizar para forzar al motor a volver atrás.

source: It can run scripts from the previous major release, Perl 4 (March 1991), but has significant differences.
es: Permite ejecutar scripts de la versión principal anterior, Perl 4 (lanzada en marzo de 1991), pero incluye diferencias importantes.

source: It collects information about your installation to include with your message, then sends the message to the right place.
es: Esta utilidad recopila información sobre la instalación para incluirla en el mensaje y después envía el informe a la dirección adecuada.

source: It couldn't possibly affect anything else, so no need to test beyond the single affected .t, right?
es: No podía afectar a nada más, por lo que no era necesario probar más que el archivo .t en cuestión.

source: It creates a directory with stubs of all the necessary files to start a new module, according to recent "best practice" for module development, and is invoked from the command line, thus:
es: Crea un directorio con el esqueleto de todos los archivos necesarios para iniciar un nuevo módulo, según las "prácticas recomendadas" actuales para el desarrollo de módulos, y se invoca desde la línea de comandos de la siguiente manera:

source: It derives from the ubiquitous C programming language and to a lesser extent from sed, awk, the Unix shell, and at least a dozen other tools and languages.
es: Se deriva del extendido lenguaje de programación C y, en menor medida, de sed, awk, la shell de Unix, y al menos una docena más de lenguajes y herramientas.

source: It describes in detail how to cope with most idiosyncrasies that the C<Configure> script can't work around for any given system or architecture.
es: En este documento se describe en detalle cómo tener en cuenta la mayor parte de las idiosincrasias que el script C<Configure> no puede prever para una arquitectura o un sistema específicos.

source: It does not even aim to be entirely accurate.
es: Tampoco explica el lenguaje en detalle.

source: It does not check the full stack, but only the name of the innermost active recursion.
es: No comprueba toda la pila; solo comprueba el nombre de la recursión activa más interna.

source: It does not receive any additional arguments.
es: No recibe ningún argumento adicional.

source: It does this by placing the names in a symbol table, which is implemented in Perl using a L</hash table>.
es: Para ello coloca los nombres en un tabla de símbolos que se implementa en Perl como una L</tabla hash>.

source: It doesn't make much sense to decode a PNG image into a text string.
es: (por ejemplo, no tiene sentido descodificar una imagen PNG en una cadena de texto).

source: It generates a constructor for you, as well as the accessors you define.
es: También genera automáticamente un constructor y todos los métodos de acceso que defina.

source: It has a lot of features, a big ecosystem, and a thriving user base.
es: Dispone de muchas características, un gran ecosistema y una importante base de usuarios.

source: It has an incredibly minimal API and absolutely no dependencies (core or not).
es: Tiene una interfaz de programación realmente mínima y carece de dependencias (del núcleo o externas).

source: It has been suggested that these modules should be removed, since the distribution became rather large, and the common criterion for new module additions is now limited to modules that help to build, test, and extend perl itself.
es: Se ha sugerido que hay que quitar estos módulos, ya que la distribución ha crecido bastante y ahora el criterio para agregar módulos nuevos es limitarse a aquellos módulos que ayuden a compilar, probar y extender el intérprete perl.

source: It has no dependencies, and almost no syntax to learn.
es: No presenta dependencias y casi no hay sintaxis que aprender.

source: It has now been split off with C<pp_unpack> to its own file, F<pp_pack.c>]
es: Ahora se ha escindido de C<pp_unpack> en su propio archivo, F<pp_pack.c>]

source: It has the information about the modules (with their versions) included with each release of Perl.
es: Este módulo contiene información sobre los módulos (con sus versiones) incluidos en cada versión de Perl.

source: It initially switches to the C<DB> package so that the debugger doesn't interfere with variables in the program you are trying to debug.
es: Inicialmente cambia al paquete C<DB>, de forma que el depurador no interfiera con las variables del programa que intenta depurar.

source: It introduced the concept of references, complex data structures, and modules.
es: Perl 5 incorpora referencias, estructuras de datos complejas y módulos.

source: It is I<not> resolved based on the object's class.
es: I<NO> se resuelve en base a la clase del objeto.

source: It is also possible to keep C<origin> as a git remote, and add a new remote for ssh access:
es: También es posible mantener C<origin> como un repositorio remoto de git y agregar un repositorio remoto nuevo para acceso ssh:

source: It is also useful when writing C<lex>-like scanners, when you have several patterns that you want to match against consequent substrings of your string; see the previous reference.
es: También es útil al escribir escáneres tipo C<lex>, cuando se tienen varios patrones de los que se desea buscar coincidencias con subcadenas posteriores de la cadena. Vea la referencia anterior.

source: It is an error to refer to a name not defined by a C<< (?<NAME>) >> earlier in the pattern.
es: Es un error usar C<< (?<NOMBRE>) >> para hacer referencia a un nombre no definido anteriormente en el patrón.

source: It is an error to refer to a name that is not declared somewhere in the pattern.
es: Es un error hacer referencia a un nombre que no se haya declarado en ninguna parte del patrón.

source: It is assumed that you already know the difference between bytes and characters, and realise (and accept!)
es: Se supone que ya conoce la diferencia entre bytes y caracteres, y comprende (y acepta)

source: It is available starting from perl 5.10.0.
es: Está disponible a partir de perl 5.10.0.

source: It is called with a pointer to the stash, and a I<level> of 0.
es: Se llama con un puntero al hash de tabla de símbolos, y un valor de I<level> igual a 0.

source: It is distributed in releases and comes in well-defined packages.
es: Se distribuye en versiones y se proporciona en paquetes bien definidos.

source: It is equivalent to C<(?!)>, but easier to read.
es: Es equivalente a C<(?!)>, pero más fácil de leer.

source: It is fast, powerful and flexible, but requires some setup and to automate the process an auxiliary shell script is needed.
es: Es un comando rápido, eficaz y flexible, pero debe ser configurado y la automatización del proceso requiere un script de shell auxiliar.

source: It is generally easier to read C<$var_names_like_this> than C<$VarNamesLikeThis>, especially for non-native speakers of English.
es: Generalmente resulta más fácil leer C<$nombres_de_variable_como_este> que C<$NombresDeVariableComoEste> (especialmente para los no castellanohablantes).

source: It is not concerned with displaying any details of the compressed data stored in the zip file.
es: No muestra detalles sobre los datos comprimidos que se encuentran almacenados en dicho archivo zip.

source: It is not really a L</LIST>, but an expression that yields C<undef> in L</scalar context> and a L</list value> with zero elements in L</list context>.
es: En realidad no es una L</LISTA>, sino una expresión que devuelve C<undef> en L</contexto escalar> y un L</valor de lista> con cero elementos en L</contexto de lista>.

source: It is not recommended for production code.
es: No se recomienda para código en producción.

source: It is often more readable to use the C<< => >> operator between key/value pairs.
es: El operador C<< => >> entre los pares clave/valor suele mejorar la legibilidad.

source: It is particularly important to have this graft line if any bisecting is done in the area of the "merge" in question.
es: Es especialmente importante injertar esta línea si se va a realizar alguna bisección en el área de la "combinación" en cuestión.

source: It is possible to ask for a different method resolution order with the L<mro> pragma.
es: Se puede usar el pragma L<mro> para solicitar un orden de resolución de métodos distinto.

source: It is possible to explicitly call a parent method from a child:
es: Es posible llamar explícitamente a un método de la clase primaria desde una clase derivada:

source: It is possible to manually set C<@ISA>, and you may see this in older Perl code.
es: Es posible establecer C<@ISA> manualmente; puede ver esto en código Perl antiguo.

source: It is possible to replace such an alphanumeric name with an expression that returns a reference to the appropriate type.
es: Es posible sustituir cualquier nombre alfanumérico por una expresión que devuelva una referencia al tipo apropiado.

source: It is probably useful only when combined with C<(?{})> or C<(??{})>.
es: Es probable que sólo sea útil cuando se combina con C<(?{})> o C<(??{})>.

source: It is recommended that for this usage you put the DEFINE block at the end of the pattern, and that you name any subpatterns defined within it.
es: Para este uso, se recomienda colocar el bloque DEFINE al final del patrón, y asignar nombres a los subpatrones definidos en su interior.

source: It is recommended to use the B<-x> option to C<git cherry-pick> in order to record the SHA1 of the original commit in the new commit message.
es: Se recomienda usar la opción B<-x> de C<git cherry-pick> para registrar la función hash SHA1 de la confirmación original en el nuevo mensaje de confirmación.

source: It is similar to the command line mode of the L<CPAN> module,
es: Es similar al modo de línea de comandos del módulo L<CPAN>,

source: It is specifically designed to be reusable by other modules or programs.
es: Está diseñado específicamente para que otros módulos o programas lo puedan reutilizar.

source: It is still possible to backtrack past the construct, but not into it.
es: Se puede dar marcha atrás más allá de la construcción, pero no volver a entrar en ella.

source: It is the responsibility of the F<.pm> file to load (or arrange to autoload) any additional functionality.
es: El archivo F<.pm> debe encargarse de cargar cualquier funcionalidad adicional (o producir la carga automática).

source: It is therefore conventional for a module to use only keys that begin with the module's name (the name of its main package) and a "/" character.
es: Por ello, se sigue la convención de que en un módulo deben usarse únicamente claves que empiecen por el nombre del módulo (el nombre del paquete principal) seguido de un carácter "/".

source: It is typically run by the makefiles created by L<ExtUtils::MakeMaker>.
es: Lo suelen ejecutar los archivos makefile generados por L<ExtUtils::MakeMaker>.

source: It is worth noting that C<\G> improperly used can result in an infinite loop.
es: Cabe señalar que un uso incorrecto de C<\G> puede provocar un bucle infinito.

source: It is written in the POD format (see pod/perlpod.pod) which is specifically designed to be readable as is.
es: Está escrito en formato POD (vea pod/perlpod.pod), un formato diseñado específicamente para ser legible tal cual.

source: It is written in the POD format (see pod/perlpod.pod) which is specially designed to be readable as is.
es: Está escrito en formato POD (vea pod/perlpod.pod), un formato diseñado específicamente para ser legible tal cual.

source: It is, however, very simple, pure Perl, and it has no non-core dependencies.
es: Sin embargo, es muy simple, está programado en Perl puro y no tiene ninguna dependencia externa al núcleo.

source: It isn't the reference that is blessed as an object; it's the thing the reference refers to (i.e. the referent).
es: No es la referencia la que se bendice como un objeto; se bendice aquello a lo que alude la referencia (es decir, el referente).

source: It looks like most programming languages you're likely to have experience with, so if you've ever written a C program, an awk script, a shell script, or even a BASIC program, you're already partway there.
es: Perl se parece a la mayoría de los lenguajes de programación con los que es probable que tenga experiencia, por lo que si ya ha escrito programas en C, scripts en awk o de shell, o incluso un programa en BASIC, no le costará adaptarse.

source: It makes a lot of sense to create a C<HasOnOffSwitch> role and apply it to both classes.
es: Tiene sentido crear un rol C<TieneInterruptor> y aplicarlo a ambas clases.

source: It makes no sense to deal with bytes in a text string, and it makes no sense to deal with characters in a byte string.
es: No tiene sentido trabajar con bytes en una cadena de texto o trabajar con caracteres en una cadena de bytes.
